{
	"name" : "H3Evo",
	"description" : "<h1>H3Evo</h1><p>H3Evo is an extensive mod for <strong>Heroes of Might and Magic III</strong> that builds upon the <strong>Shadow of Death</strong> (SoD) expansion and the <strong>Horn of the Abyss</strong> (HotA) fan expansion. The mod also adds a fan-made brand-new faction called the <strong>Heavenly Forge</strong>, along with various other modifications and enhancements to add more balance and enrich the gameplay experience.</p><h2>H3Evo builds and expands upon these mods</h2><ul><li><strong>Shadow of Death</strong>: The base game expansion providing additional campaigns, artifacts, and gameplay features.</li><li><strong>Horn of the Abyss</strong>: A well-known fan expansion that introduces the new Cove faction, new artifacts, gameplay mechanics, and balance changes.</li><li><strong>Heavenly Forge</strong>: A new fan-made faction, adding a fresh layer of strategy and content to the game.</li><li><strong>Additional Mods and Changes</strong>: Various smaller mods and tweaks have been integrated where appropriate to improve or diversify gameplay.</li></ul><h1>HotA</h1><p>For detailed information on the Horn of the Abyss mod, you can visit the official page <a href=\"https://h3hota.com/\">here</a> or this <a href=\"https://heroes.thelazy.net//index.php/Main_Page\">wiki</a>.</p><h2>Notable missing HotA features from VCMI</h2><ul><li>Factory faction</li><li>Spell research</li><li>Arena mode</li></ul><h2>Changes</h2><ul><li><strong>Warehouses</strong> reward random number of resources (they behave more like a windmill for one resource).<ul><li><code>Wood Warehouse</code> and <code>Ore Warehouse</code> will give 7-14 of the respective resource</li><li><code>Crystal Warehouse</code>, <code>Gems Warehouse</code>, <code>Sulfur Warehouse</code>, and <code>Mercury Warehouse</code> will give 5-9 of the respective resource</li></ul></li><li><code>Experimental Shop</code> rewards <code>Drake Golems</code> instead of <code>Giants</code></li><li><code>Ancient Lamp</code> appears now only on <em>snow</em> terrain. On <em>sand</em> terrain it is replaced by <code>Mirage Lamp</code> (rewards randomly <em>Master Genies</em> or <em>Efreet Sultans</em>). See <code>Mirage Lamp</code> for more details.</li><li>These artifacts were changed from combined to fused: <code>Diplomats Cloak</code>, <code>Golden Goose</code>, <code>Ironfist Of The Ogre</code>, <code>Pendant Of Reflection</code></li><li><code>Dimension Door</code> (DD) balance changes:<ul><li>DD can be used 1x per day, exception being 2x per day for XL+U or bigger maps (41472 tiles) or if hero has expert air magic</li><li>DD doesn't work into tiles under Fog of War (unlike H3)</li><li>DD will hint regarding tile being incompatible terrain type: water/land (unlike H3)</li><li>DD on incompatible terrain (water/land) will not spend mana, movement, or decrease the allowed casts per day (unlike H3)</li><li>DD will initiate a fight upon landing on tile adjacent to neutral creature</li></ul></li></ul><h1>Tides of War (ToW)</h1><p>For information about the mod you can visit this page <a href=\"https://heroes3wog.net/the-tides-of-war-download-vcmi/\">here</a>.</p><p>From ToW only new creatures are used:</p><ul><li><strong>Alternative Creatures</strong> (1 new alternative creature for each SoD faction). More details <a href=\"https://github.com/krs0/H3Evo/wiki/ToW-Alternative-Creatures\">here</a>.</li><li>New neutral creatures: <code>Mermaid</code>, <code>Ghost</code>, <code>Dread Skipper</code>. More details <a href=\"https://github.com/krs0/H3Evo/wiki/ToW-Neutral-Creatures\">here</a>.</li></ul><h1>Heavenly Forge</h1><p>For information about the mod you can visit the mod's page <a href=\"https://vcmi.eu/Mod%20Repository/Town/Heavenly%20Forge%202000/\">here</a>.</p><p>Various balance changes were applied to this mod:</p><ul><li>Creature stats were rebalanced for almost all creatures (values are similar to PVP mod)</li><li>Hero starting armies are now: 15-25 <code>Grunts</code>, 5-7 <code>Cyber Dead</code>, 3-4 <code>Pyros</code></li></ul><h1>SoD Miscellaneous Changes</h1><p>For detailed information about the changes see <a href=\"https://github.com/krs0/H3Evo/wiki/SoD-New-Objects\">here</a>.</p><h2>Artifact changes:</h2><ul><li>New artifact type: <code>Fused Artifacts</code> - Combined artifacts that take up only 1 slot and cannot be disassembled anymore.<ul><li>These artifacts were changed from combined to fused: <code>Bow Of The Sharpshooter</code>, <code>Ring Of The Magi</code>, <code>Cornucopia</code>, <code>Statue Of Legion</code>, <code>Elixir Of Life</code>, <code>Wizard's Well</code></li></ul></li><li><code>Boots of Speed</code> - Changed class from Minor to Major</li><li><code>Pendant Of Second Sight</code> - Changed class from Major to Minor</li></ul><h2>Map Objects Changes</h2><ul><li>New map object <code>Cursed Lamp</code> found on lava, gives Efreeti</li><li>New map object <code>Mirage Lamp</code> found on sand, gives Efreeti or Genies</li><li>New creature bank <code>Demon Domain</code>. Defeat a mixed inferno army to gain Efreeti. Can appear on <code>Lava</code>, <code>Asphalt</code>, and <code>Sand</code> terrains.</li></ul><h2>Faction Changes</h2><h3>Inferno</h3><ul><li>Added penalty to Lava terrain: new penalty is 125% instead of no penalty (100%)</li><li><code>Castle Gate</code> building cost reduced from 10,000 Gold to 5000 Gold<table><thead><tr><th>Old Cost</th><th>New Cost</th></tr></thead><tbody><tr><td>10,000 Gold, 5 Wood, 5 Ore</td><td>5,000 Gold, 5 Wood, 5 Ore</td></tr></tbody></table></li><li><code>Ash</code> now starts with Basic Fire Magic instead of Basic Eagle Eye</li></ul><h3>Necropolis</h3><ul><li><code>Skeleton transformer</code> building cost increased from 1000 to 1500 gold</li><li><code>Necromancy Amplifier</code> building cost increased from 1000 to 1500 gold</li><li>New War Machine: <code>Plague tent</code> instead of the first Aid tent. It casts disease (attack and defense values reduced by 2 for a period of 3 rounds) (Depends on Andruids original Plague Tent mod).</li><li>New Hero: <code>Bubonic</code> with specialty Plague Tent (Depends on Andruids original Plague Tent mod).</li></ul><h3>Dungeon</h3><ul><li><code>Mana Vortex</code> building cost increased from 1000 to 2500 gold</li></ul><h1>WoG</h1><p>From WoG only a small part is used:</p><ul><li><a href=\"https://github.com/krs0/H3Evo/wiki/WoG-Neutral-Creatures\">Neutral Creatures</a> - <code>Santagremlin</code>, <code>Sylvancentaur</code>, <code>Arcticsharpshooter</code>, <code>Lavasharpshooter</code>, <code>Nightmare</code>, <code>Hellsteed</code>, <code>Wogsorceress</code>, <code>Warzealot</code>, <code>Gorynych</code>, <code>Dracolich</code></li><li>H3 Data patches - WoG Improvements to original Heroes III assets.</li><li>Map decorations - WoG Improvements to original Heroes III assets.</li><li>WoG Graphic Fixes - A remarkable graphical enhancement mod that upgrades numerous assets from SoD, HotA, and WoG, while also introducing a plethora of new visuals. You can find more details on the mods <a href=\"http://wforum.heroes35.net/showthread.php?tid=5352&page=1\">official forum</a>.</li></ul><h2>Changes</h2><ul><li>Disabled all variations of Treasure chest (only the green Treasure Chest added).</li><li>Removed small prison (HotA 1.7 version will be used).</li><li>Reverted subpar Shrine Of Magic Level 3 graphics changes.</li><li>Disabled <code>Werewolves</code> and their dwelling, because they exist also in ToW mod.</li></ul>",
	"modType" : "Expansion",
	"author": "Mod compilation by KRS, incorporating works from other modders, including PvP Balance mod objects by Wnukos and graphical assets by Andruids.",
	"contact" : "",
	"licenseName" : "Creative Commons Attribution-ShareAlike",
	"licenseURL" : "http://creativecommons.org/licenses/by-sa/4.0/deed",
	"version" : "0.0.16",
	"downloadSize" : 1,
	"changelog" :
	{
		"0.0.16" : [ "Add wiki style mod documentation to mod description" ],
		"0.0.15" : [ "ReEnabled HotA small prisons since they were fixed in 1.7" ],
		"0.0.14" : [ "Added WoG dependency" ],
		"0.0.13" : [ "Changed Skeleton Transformer description to include conversion of living dragons, to bone dragons" ],
		"0.0.12" : [ "Increased Dungeon's Mana Vortex building cost from 1000 to 2500" ],
		"0.0.11" : [ "Add movement penalty for Lava terrain: change movement cost from 100% to 125%" ],
		"0.0.10" : [ "Reduced gold cost for building Inferno's Castle Gate from 10000 to 5000" ],
		"0.0.9" : [ "Increased building cost for Necropolis Skeleton Transformer and Necromancy Amplifier to 1500" ],
		"0.0.8" : [ "Ash (has bloodlust starting spell). Starts now with basic fire magic instead of Eagle Eye" ],
		"0.0.7" : [ "Disabled HotA small prisons" ],
		"0.0.6" : [ "Disabled mythril icon for gold" ],
		"0.0.5" : [ "Disabled WoG chests, except green ones" ],
		"0.0.4" : [ "Disabled WoG warewolves, that were coliding with tow warewolves" ],
		"0.0.3" : [ "HotA Warehouses now have random reward quantities" ],
		"0.0.2" : [ "Added Plague Tent as war machine. It is the default warmachine in Necropolis." ],
		"0.0.1" : [ "Initial Revision with new artifacts: Cursed Lamp and Mirage Lamp" ]
	},
	"compatibility" :
	{
		"min" : "1.6.0"
	},
	"depends" :
	[
		"hota",
		"wake-of-gods",
		"wake-of-gods.creatures",
		"forge2k",
		"tides-of-war",
		"tides-of-war.alternative-creatures",
		"tides-of-war.neutral-creatures",
		"tides-of-war.hota-balance-compatibility-patch",
		"fused-artifacts",
		"fused-artifacts.fusedartifactssod",
		"fused-artifacts.fusedartifactshota",
		"andruids-expansion",
		"andruids-expansion.plaguetent"
	],
	"conflicts" :
	[
		"hota.mainMenu",
		"wake-of-gods.level8Units",
		"wake-of-gods.animatedObjects",
		"wake-of-gods.animatedTrees",
		"wake-of-gods.artifacts",
		"wake-of-gods.battleDecorations",
		"wake-of-gods.Commanders",
		"wake-of-gods.creatureBanks",
		"wake-of-gods.mainMenu",
		"wake-of-gods.mapdecorations",
		"wake-of-gods.mapObjects",
		"wake-of-gods.mapSupport",
		"wake-of-gods.messengersAndEmissaries",
		"wake-of-gods.skills",
		"wake-of-gods.spells",
		"wake-of-gods.stackArtifacts",
		"wake-of-gods.stackExperience",
		"wake-of-gods.vividBattlefields",
		"wake-of-gods.warMachinesOnMap",
		"wake-of-gods.heroes3datapatch",
		"wake-of-gods.woggraphicfix.wf_level8Units",
		"wake-of-gods.woggraphicfix.wf_h3creatures",
		"wake-of-gods.woggraphicfix.wf_messengersAndEmissaries",
		"wake-of-gods.woggraphicfix.wf_artifacts",
		"wake-of-gods.woggraphicfix.wf_heroes",
		"wake-of-gods.woggraphicfix.wf_commanders",
		"wake-of-gods.woggraphicfix.wf_mapobjects",
		"wake-of-gods.woggraphicfix.wf_arrow",
		"tides-of-war.objects",
		"tides-of-war.artifacts",
		"tides-of-war.banks",
		"tides-of-war.heroes",
		"tides-of-war.tow-main-menu",
		"tides-of-war.skills",
		"tides-of-war.spells",
		"andruids-expansion.damned utopia",
		"andruids-expansion.initiative",
		"andruids-expansion.minotaur warlock",
		"andruids-expansion.powerbond"
	],
	"settings" : {
		"spells" : {
			// if enabled, dimension door can be used 1x per day, exception being 2x per day for XL+U or bigger maps (41472 tiles) + hero having expert air magic
			"dimensionDoorTournamentRulesLimit" : true,
			// if enabled, dimension work doesn't work into tiles under Fog of War
			"dimensionDoorOnlyToUncoveredTiles" : true,
			// if enabled, dimension door will hint regarding tile being incompatible terrain type, unlike H3 (water/land)
			"dimensionDoorExposesTerrainType" : true,
			// if enabled, attempt to use dimension door on incompatible terrain (water/land) will result in spending of mana, movement and casts per day (H3 behavior)
			"dimensionDoorFailureSpendsPoints" : false,
			// if enabled, dimension door will initiate a fight upon landing on tile adjacent to neutral creature
			"dimensionDoorTriggersGuards" : true
		}
	}
}
